
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВызоваОтчета", Истина);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "Номенклатура_Карточка");
	ПараметрыФормы.Вставить("ПараметрыЗаполнения", Новый Структура("ОбъектДанных,ИмяСхемы", "Справочник.Номенклатура", "ПечатнаяФорма"));
	ПараметрыФормы.Вставить("КлючВарианта", "КарточкаТовара");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Ссылка", ПараметрКоманды));
	
	УстановитьСхему("Справочник.Номенклатура", "ПечатнаяФорма");
	
	ОткрытьФорму("Отчет.УниверсальныйОтчет.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
КонецПроцедуры

&НаСервере
Процедура УстановитьСхему(знач ОбъектДанных, знач ИмяСхемы)
	Менеджер = Новый (СтрЗаменить(ОбъектДанных, ".", "Менеджер."));
	СхемаКомпоновкиДанных = Менеджер.ПолучитьМакет(ИмяСхемы);
	ХранилищеОбщихНастроек.Сохранить("УниверсальныйОтчет", , СхемаКомпоновкиДанных, , ИмяПользователя());
КонецПроцедуры

